app/Controllers/Pemeriksa.php

    public function index()
    {
        $pemeriksa = $this->M_Pemeriksa->findAll();
---
SELECT *
FROM `pemeriksa`