app/Models/M_Pengguna.php

SELECT *
FROM `pengguna`
---
    public function all_data()
    {
        return $this->db->table('pengguna')
            ->get()
            ->getResultArray();